<!-- dflook/terraform-github-actions {"workspace":"default","backend_type":"s3","backend":"a06a524a2f69bee7788dbbc13b2df25bfe60c9097a2b6945f04684b245d05abe","plan_job_ref":"Job Validations on PR #52 at https://github.com/SelfOverflow/discord-bots/actions/runs/22537431169","plan_out_hash":"2ee8291e637384e88270578a1635d264bafb16b6bc36b6005f0b5e56e41593d9","plan_hash":"46fd80fe19f32da226f5422ace580a82fe3a4623ee2f6c6f8b1b0e3625f3b9e9","plan_text_format":"diff","version":"2.0.0","closed":true} -->
Terraform plan in __./apps/bablu/terraform__
With variables: `image_tag = "f9b2f83014080efb8e88c7dc7d48b2b7b2a1f001"`
<details>
<summary>Plan: 4 to add, 1 to change, 1 to destroy.</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create
!~  update in-place
-/+ destroy and then create replacement
 <= read (data resources)

Terraform will perform the following actions:

  # data.aws_iam_policy_document.execution_secrets_policy will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "execution_secrets_policy" {
+       id            = (known after apply)
+       json          = (known after apply)
+       minified_json = (known after apply)

+       statement {
+           actions   = [
+               "secretsmanager:GetSecretValue",
            ]
+           resources = [
+               (known after apply),
            ]
        }
    }

  # aws_ecs_service.bot will be updated in-place
!~  resource "aws_ecs_service" "bot" {
        id                                 = "arn:aws:ecs:ap-south-1:613419461354:service/bablu-bot-cluster/bablu-bot-service"
        name                               = "bablu-bot-service"
        tags                               = {
            "Environment" = "mono"
            "ManagedBy"   = "terraform"
            "Project"     = "bablu-bot"
        }
!~      task_definition                    = "arn:aws:ecs:ap-south-1:613419461354:task-definition/bablu-bot-task:3" -> (known after apply)
#        (16 unchanged attributes hidden)

#        (3 unchanged blocks hidden)
    }

  # aws_ecs_task_definition.bot must be replaced
-/+ resource "aws_ecs_task_definition" "bot" {
!~      arn                      = "arn:aws:ecs:ap-south-1:613419461354:task-definition/bablu-bot-task:3" -> (known after apply)
!~      arn_without_revision     = "arn:aws:ecs:ap-south-1:613419461354:task-definition/bablu-bot-task" -> (known after apply)
!~      container_definitions    = jsonencode(
            [
-               {
-                   environment      = [
-                       {
-                           name  = "DYNAMODB_TABLE"
-                           value = "bablu-bot-users"
                        },
-                       {
-                           name  = "NODE_ENV"
-                           value = "production"
                        },
-                       {
-                           name  = "SQS_QUEUE_URL"
-                           value = "https://sqs.ap-south-1.amazonaws.com/613419461354/bablu-bot-events"
                        },
                    ]
-                   essential        = true
-                   image            = "613419461354.dkr.ecr.ap-south-1.amazonaws.com/bablu-container-repository:317aa4bd99b1a8bba1e0e49b4f3a6cf1e5aa5b72"
-                   logConfiguration = {
-                       logDriver = "awslogs"
-                       options   = {
-                           awslogs-group         = "/ecs/bablu-bot"
-                           awslogs-region        = "ap-south-1"
-                           awslogs-stream-prefix = "ecs"
                        }
                    }
-                   mountPoints      = []
-                   name             = "bot"
-                   portMappings     = []
-                   systemControls   = []
-                   volumesFrom      = []
                },
            ]
        ) -> (known after apply) # forces replacement
!~      enable_fault_injection   = false -> (known after apply)
!~      id                       = "**************" -> (known after apply)
!~      revision                 = 3 -> (known after apply)
        tags                     = {
            "Environment" = "mono"
            "ManagedBy"   = "terraform"
            "Project"     = "bablu-bot"
        }
#        (12 unchanged attributes hidden)
    }

  # aws_iam_policy.execution_secrets_policy will be created
+   resource "aws_iam_policy" "execution_secrets_policy" {
+       arn              = (known after apply)
+       attachment_count = (known after apply)
+       id               = (known after apply)
+       name             = "bablu-bot-execution-secrets-policy"
+       name_prefix      = (known after apply)
+       path             = "/"
+       policy           = (known after apply)
+       policy_id        = (known after apply)
+       tags_all         = (known after apply)
    }

  # aws_iam_role_policy_attachment.execution_secrets_attach will be created
+   resource "aws_iam_role_policy_attachment" "execution_secrets_attach" {
+       id         = (known after apply)
+       policy_arn = (known after apply)
+       role       = "bablu-bot-ecs-execution-role"
    }

  # aws_secretsmanager_secret.discord_token will be created
+   resource "aws_secretsmanager_secret" "discord_token" {
+       arn                            = (known after apply)
+       force_overwrite_replica_secret = false
+       id                             = (known after apply)
+       name                           = "bablu-bot-discord-token"
+       name_prefix                    = (known after apply)
+       policy                         = (known after apply)
+       recovery_window_in_days        = 30
+       tags                           = {
+           "Environment" = "mono"
+           "ManagedBy"   = "terraform"
+           "Project"     = "bablu-bot"
        }
+       tags_all                       = {
+           "Environment" = "mono"
+           "ManagedBy"   = "terraform"
+           "Project"     = "bablu-bot"
        }

+       replica (known after apply)
    }

Plan: 4 to add, 1 to change, 1 to destroy.
```
</details>

:white_check_mark: Plan applied in [Post merge deploy to production #31](https://github.com/SelfOverflow/discord-bots/actions/runs/22537485280)
<details><summary>Outputs</summary>

```hcl
dynamodb_table_name    = "bablu-bot-users"
ecr_repository_url     = "613419461354.dkr.ecr.ap-south-1.amazonaws.com/bablu-container-repository"
ecs_cluster_name       = "bablu-bot-cluster"
ecs_execution_role_arn = "arn:aws:iam::613419461354:role/bablu-bot-ecs-execution-role"
ecs_security_group     = "sg-0d73227267aa70d86"
ecs_task_role_arn      = "arn:aws:iam::613419461354:role/bablu-bot-ecs-task-role"
public_subnets         = [
    "subnet-015fbb31ea79e0066",
    "subnet-0da3df806465ee531",
]
sqs_queue_url          = "https://sqs.ap-south-1.amazonaws.com/613419461354/bablu-bot-events"
vpc_id                 = "vpc-012652892da27fe36"
```
</details>